# shared - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.simple_email_service.aws_ses_domain_identity.default: Refreshing state... [id=staging-mail.connectilly.com]
module.common_resources.module.simple_email_service.aws_ses_domain_dkim.default: Refreshing state... [id=staging-mail.connectilly.com]
module.common_resources.module.cognito_user_pool.aws_cognito_user_pool.default: Refreshing state... [id=us-east-1_s4JTkt6dh]
module.common_resources.module.cognito_user_pool.aws_cognito_identity_provider.google_provider: Refreshing state... [id=us-east-1_s4JTkt6dh:Google]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.common_resources.aws_ssm_parameter.gcp_connectilly_web_credentials_client_id will be created
  + resource "aws_ssm_parameter" "gcp_connectilly_web_credentials_client_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "gcp_connectilly_web_credentials_client_id"
      + tags           = {
          + "environment" = "staging"
          + "resource"    = "shared"
        }
      + tags_all       = {
          + "environment" = "staging"
          + "resource"    = "shared"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common_resources.aws_ssm_parameter.gcp_connectilly_web_credentials_client_secret will be created
  + resource "aws_ssm_parameter" "gcp_connectilly_web_credentials_client_secret" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "gcp_connectilly_web_credentials_client_secret"
      + tags           = {
          + "environment" = "staging"
          + "resource"    = "shared"
        }
      + tags_all       = {
          + "environment" = "staging"
          + "resource"    = "shared"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common_resources.module.cockroachdb_serverless_cluster.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "cockroachdb_serverless_cluster_id"
      + tags           = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "serverless-cluster"
        }
      + tags_all       = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "serverless-cluster"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common_resources.module.cockroachdb_serverless_cluster.cockroach_cluster.default will be created
  + resource "cockroach_cluster" "default" {
      + account_id        = (known after apply)
      + cloud_provider    = "AWS"
      + cockroach_version = (known after apply)
      + creator_id        = (known after apply)
      + id                = (known after apply)
      + name              = "staging"
      + operation_status  = (known after apply)
      + plan              = (known after apply)
      + regions           = [
          + {
              + name       = "us-east-1"
              + node_count = (known after apply)
              + primary    = (known after apply)
              + sql_dns    = (known after apply)
              + ui_dns     = (known after apply)
            },
        ]
      + serverless        = {
          + routing_id  = (known after apply)
          + spend_limit = 0
        }
      + state             = (known after apply)
      + upgrade_status    = (known after apply)
    }

  # module.common_resources.module.cognito_user_pool.aws_cognito_identity_provider.google_provider will be updated in-place
  ~ resource "aws_cognito_identity_provider" "google_provider" {
        id                = "us-east-1_s4JTkt6dh:Google"
      ~ provider_details  = {
          - "attributes_url"                = "https://people.googleapis.com/v1/people/me?personFields=" -> null
          - "attributes_url_add_attributes" = "true" -> null
          - "authorize_url"                 = "https://accounts.google.com/o/oauth2/v2/auth" -> null
          - "oidc_issuer"                   = "https://accounts.google.com" -> null
          - "token_request_method"          = "POST" -> null
          - "token_url"                     = "https://www.googleapis.com/oauth2/v4/token" -> null
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.common_resources.module.cognito_user_pool.aws_cognito_user_pool_domain.default will be created
  + resource "aws_cognito_user_pool_domain" "default" {
      + aws_account_id                  = (known after apply)
      + cloudfront_distribution         = (known after apply)
      + cloudfront_distribution_arn     = (known after apply)
      + cloudfront_distribution_zone_id = (known after apply)
      + domain                          = "stagingconnectilly"
      + id                              = (known after apply)
      + s3_bucket                       = (known after apply)
      + user_pool_id                    = "us-east-1_s4JTkt6dh"
      + version                         = (known after apply)
    }

  # module.common_resources.module.cognito_user_pool.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "user_pool_id"
      + tags           = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "cognito-user-pool"
        }
      + tags_all       = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "cognito-user-pool"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common_resources.module.kafka_serverless_cluster.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "upstash_kafka_cluster_id"
      + tags           = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "kafka-cluster"
        }
      + tags_all       = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "kafka-cluster"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common_resources.module.kafka_serverless_cluster.upstash_kafka_cluster.default will be created
  + resource "upstash_kafka_cluster" "default" {
      + cluster_id              = (known after apply)
      + cluster_name            = "staging"
      + creation_time           = (known after apply)
      + id                      = (known after apply)
      + max_message_size        = (known after apply)
      + max_messages_per_second = (known after apply)
      + max_partitions          = (known after apply)
      + max_retention_size      = (known after apply)
      + max_retention_time      = (known after apply)
      + multizone               = false
      + password                = (sensitive value)
      + region                  = "us-east-1"
      + rest_endpoint           = (known after apply)
      + state                   = (known after apply)
      + tcp_endpoint            = (known after apply)
      + type                    = (known after apply)
      + username                = (known after apply)
    }

Plan: 8 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*